import React from 'react';

const Terms = () => {
    return (
        <div className="container">
            <strong>Условия и положения</strong> <p>
            При загрузке или использовании приложения настоящие условия будут
            автоматически применяются к вам – поэтому вы должны убедиться
            , что внимательно прочитали их перед использованием приложения. Ты не такой
            разрешено копировать или изменять приложение, любую часть приложения или
            наши товарные знаки любым способом. Вам не разрешается пытаться
            извлечь исходный код приложения, и вы также не должны пытаться
            перевести приложение на другие языки или создавать производные
            версии. Само приложение и все товарные знаки защищены авторским правом,
            права на базы данных и другие права интеллектуальной собственности, связанные
            к нему по-прежнему относятся Ggenius.
            </p> <p>
                Ggenius стремится к тому, чтобы приложение было
            настолько полезно и эффективно, насколько это возможно. По этой причине мы
            оставляем за собой право вносить изменения в приложение или взимать плату за
            свои услуги, в любое время и по любой причине. Мы никогда не будем
            взимать с вас плату за приложение или его услуги, не делая это очень
            вам точно ясно, за что вы платите.
            </p> <p>
                What to wear приложение хранит и обрабатывает персональные данные, которые
            вы нам предоставили. Вы несете ответственность за безопасность своего телефона и
            доступа к приложению. Поэтому мы рекомендуем вам
            не делать джейлбрейк или рутирование вашего телефона, что представляет собой процесс
            удаления программных ограничений, налагаемых
            официальной операционной системой вашего устройства. Это могло бы сделать ваш
            телефон уязвим для вредоносного ПО/вирусов/вредоносных программ,
            скомпрометируйте функции безопасности вашего телефона, и это может означать
            что приложение "What to wear" не будет работать должным образом или вообще не будет работать.
            </p> <div><p>
            Приложение действительно использует сторонние сервисы, которые заявляют о своей
            условия и положения.
            </p> <p>
            Ссылка на Правила и условия предоставления услуг третьей стороной
            поставщики, используемые приложением
            </p> <ul><li><a href="https://policies.google.com/terms" target="_blank" rel="noopener noreferrer">Google Play Services</a></li><li><a href="https://www.google.com/analytics/terms/" target="_blank" rel="noopener noreferrer">Google Analytics for Firebase</a></li></ul></div> <p>
            Вы должны знать, что есть определенные вещи, за которые
            гений не возьмет на себя ответственность. Определенный
            функции приложения потребуют, чтобы у приложения был активный
            подключение к Интернету. Подключение может быть Wi-Fi или предоставляться
            вашим провайдером мобильной связи, но Ggenius
            не могу взять на себя ответственность за то, что приложение работает не в полную силу
            функциональность, если у вас нет доступа к Wi-Fi, и у вас не
            осталось ничего из вашего запаса данных.
            </p> <p></p> <p>
            Если вы используете приложение за пределами зоны с Wi-Fi, вы
            следует помнить, что условия соглашения с вашим
            оператор мобильной связи по-прежнему будет подавать заявку. В результате вы можете
            ваш оператор мобильной связи взимает плату за передачу данных для
            продолжительность подключения при доступе к приложению или
            другие сторонние сборы. Используя приложение, вы принимаете
            ответственность за любые подобные сборы, включая передачу данных в роуминге
            взимается плата, если вы используете приложение за пределами своей домашней территории
            (т.е. регион или страна) без отключения роуминга данных. Если
            вы не являетесь плательщиком счетов за устройство, на котором вы находитесь
            используя приложение, пожалуйста, имейте в виду, что мы предполагаем, что у вас есть
            получено разрешение от плательщика счета на использование приложения.
            </p> <p>
            Точно так же гений не всегда может принимать
            ответственность за то, как вы используете приложение, т.е. вам необходимо
            убедиться, что ваше устройство остается заряженным – если у него разрядилась
            батарея и вы не можете включить его, чтобы воспользоваться услугой,
            Гениус не может взять на себя ответственность.
            </p> <p>
            Что касается ответственности Ggenius за вашу
            использование приложения, когда вы используете приложение, важно
            иметь в виду, что, хотя мы стараемся постоянно
            обновлять и исправлять его, мы полагаемся на третьих лиц
            предоставлять нам информацию, чтобы мы могли сделать ее доступной
            вам. Genius не несет ответственности за любые
            убытки, прямые или косвенные, которые вы понесете в результате
            того, что полностью полагаетесь на эту функциональность приложения.
            </p> <p>
            В какой-то момент мы, возможно, захотим обновить приложение. Приложение представляет собой
            в настоящее время доступно на Android – требования к
            системе (и к любым дополнительным системам, которые мы
            решите продлить доступность приложения до) может измениться,
            и вам нужно будет загрузить обновления, если вы хотите сохранить
            с помощью приложения. Ggenius не обещает, что
            всегда будет обновлять приложение таким образом, чтобы оно было актуальным для вас
            и /или работает с той версией Android, которая у вас есть
            установлен на вашем устройстве. Однако ты обещаешь всегда
            принимая обновления приложения, когда они будут вам предложены, мы можем
            также мы хотим прекратить предоставление приложения и можем прекратить его использование
            в любое время, не уведомляя вас об этом.
            Если мы не сообщим вам об обратном, при любом расторжении договора (а)
            права и лицензии, предоставленные вам в соответствии с настоящими условиями, прекращаются;
            (б) вы должны прекратить использование приложения и (при необходимости) удалить его
            с вашего устройства.
            </p> <p><strong>Изменения в настоящих Правилах и условиях</strong></p> <p>
                Я могу обновлять наши положения и условия
                время от времени. Таким образом, мы рекомендуем вам ознакомиться с этой страницей
                периодически следите за любыми изменениями. Я буду
                уведомлять вас о любых изменениях, публикуя новые правила и
                условия на этой странице.
            </p> <p>
                Настоящие правила и условия вступают в силу с 2023-09-08
            </p> <p><strong>Связаться с нами</strong></p> <p>
                Если у вас есть какие-либо вопросы или предложения по поводу моих
                Положений и условий, не стесняйтесь обращаться ко мне
                по адресу gamelob25@gmail.com .
            </p>
        </div>
    );
};

export default Terms;