import React from 'react';

const Privacy = () => {
    return (
        <div className="container">
            <strong>Политика конфиденциальности</strong> <p>
            Genius создал приложение What to wear как
            бесплатное приложение. Эта УСЛУГА предоставляется компанией
            Ggenius бесплатно.
            </p> <p>
            Эта страница используется для информирования посетителей о моей
            политики в отношении сбора, использования и раскрытия персональных данных
            Информация, если кто-то решил воспользоваться моим сервисом.
            </p> <p>
            Если вы решите воспользоваться моим сервисом, то вы соглашаетесь на
            сбор и использование информации в связи с этим
            политика. Личная информация, которую я собираю
            , используется для предоставления и улучшения Сервиса. Я не буду использовать вашу информацию или делиться ею с
            любой, за исключением случаев, описанных в настоящей Политике конфиденциальности.
            </p> <p>
            Термины, используемые в настоящей Политике конфиденциальности, имеют те же значения
            как указано в наших Положениях и условиях, с которыми можно ознакомиться по адресу
            Что носить, если иное не определено в настоящей Политике конфиденциальности.
            </p> <p><strong>Сбор и использование информации</strong></p> <p>
            Для лучшего восприятия при использовании нашего сервиса я
            могу потребовать, чтобы вы предоставили нам определенную личную информацию
            идентифицируемая информация, включая, но не ограничиваясь, Ggenius. Информация, которую
            я запрашиваю, будет сохранена на вашем устройстве и никоим образом не будет собрана мной.
            </p> <div><p>
            Приложение действительно использует сторонние сервисы, которые могут собирать
            информация, используемая для вашей идентификации.
            </p> <p>
            Ссылка на политику конфиденциальности сторонних поставщиков услуг, используемых
            с помощью приложения
            </p> <ul><li><a href="https://www.google.com/policies/privacy/" target="_blank" rel="noopener noreferrer">Google Play Services</a></li><li><a href="https://firebase.google.com/support/privacy" target="_blank" rel="noopener noreferrer">Google Analytics for Firebase</a></li>></ul></div> <p><strong>Log Data</strong></p> <p>
            Я хочу сообщить вам, что всякий раз, когда вы
            воспользуйтесь моим сервисом в случае ошибки в приложении
            Я собираю данные и информацию (через третьих лиц
            продукты) на вашем телефоне под названием Log Data. Эти данные журнала могут
            укажите такую информацию, как интернет-протокол вашего устройства
            (“IP”) адрес, название устройства, версия операционной системы,
            конфигурация приложения при использовании моего сервиса,
            время и дата вашего использования Сервиса, а также другие
            статистика.
            </p> <p><strong>Cookies</strong></p> <p>
            Куки-файлы - это файлы с небольшим объемом данных, которые
            обычно используются в качестве анонимных уникальных идентификаторов. Они отправлены
            в ваш браузер с веб-сайтов, которые вы посещаете, и которые
            хранятся во внутренней памяти вашего устройства.
            </p> <p>
            Этот сервис не использует эти “cookies” явно. Однако
            приложение может использовать сторонний код и библиотеки, которые используют
            “cookies” для сбора информации и улучшения своих сервисов.
            У вас есть возможность либо принять эти файлы cookie, либо отказаться от них
            и знайте, когда файл cookie отправляется на ваше устройство. Если ты
            если вы решите отказаться от использования наших файлов cookie, вы, возможно, не сможете использовать некоторые из них.
            части этой услуги.
            </p> <p><strong>Поставщики услуг</strong></p> <p>
            Я могу нанимать сторонние компании и
            частных лиц по следующим причинам:
            </p> <ul><li>Чтобы облегчить наш сервис;</li> <li>Предоставлять услугу от нашего имени;</li> <li>Для выполнения услуг, связанных с обслуживанием; или</li> <li>Чтобы помочь нам в анализе того, как используется наш сервис.</li></ul> <p>
            Я хочу проинформировать пользователей об этом сервисе
            что эти третьи лица имеют доступ к их личным
            Информация. Причина в том, чтобы выполнять возложенные на
            них задачи от нашего имени. Однако они обязаны не
            разглашать и не использовать эту информацию для каких-либо других целей.
            </p> <p><strong>Безопасность</strong></p> <p>
            Я ценю ваше доверие к предоставлению нам вашего
            Личную информацию, таким образом, мы стремимся использовать в коммерческих целях
            приемлемые средства его защиты. Но помните, что ни один способ
            передачи данных через Интернет, ни один способ электронного
            хранилище на 100% безопасно и надежно, и я не могу
            гарантируем его абсолютную безопасность.
            </p> <p><strong>Ссылки на другие сайты</strong></p> <p>
            Этот сервис может содержать ссылки на другие сайты. Если вы перейдете по
            сторонней ссылке, вы будете перенаправлены на этот сайт. Обратите
            внимание, что я не управляю этими внешними сайтами.
            Поэтому я настоятельно советую вам ознакомиться
            с Политикой конфиденциальности этих веб-сайтов. У меня есть
            не контролируем и не несем никакой ответственности за содержание,
            политику конфиденциальности или действия любых сторонних сайтов или
            услуги.
            </p> <p><strong>Неприкосновенность частной жизни детей</strong></p> <div><p>
                Эти услуги не предназначены для лиц младше 13 лет.
                Я сознательно не собираю деньги лично
                идентифицируемая информация от детей в возрасте до 13 лет. В случае
                Я обнаруживаю, что ребенок младше 13 лет предоставил
                мне личную информацию, я немедленно
                удалите это с наших серверов. Если вы являетесь родителем или опекуном
                и вы знаете, что ваш ребенок предоставил нам
                личная информация, пожалуйста, свяжитесь со мной, чтобы
                Я смогу выполнить необходимые действия.
            </p></div><p><strong>Изменения в настоящей Политике конфиденциальности</strong></p> <p>
                Я могу обновить нашу политику конфиденциальности с
                время от времени. Таким образом, мы рекомендуем вам ознакомиться с этой страницей
                периодически следите за любыми изменениями. Я буду
                уведомлять вас о любых изменениях, размещая новую политику конфиденциальности на
                этой странице.
            </p> <p>Эта политика вступает в силу с 2023-09-08</p> <p><strong>Связаться с нами</strong></p> <p>
                Если у вас есть какие-либо вопросы или предложения по поводу моей
                политики конфиденциальности, не стесняйтесь обращаться ко мне по адресу gamelob25@gmail.com .
            </p>
        </div>
    );
};

export default Privacy;